CBMA/target/classes/ApiRequests/001/CreateHouseRecordInput.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hous="http://webservices.cox.com/Cox_HouseInterface/pub/wsd/providers/HouseMaster/v1/HouseMaster">
   <soap:Header/>
   <soap:Body>
      <hous:createHouseRecord>
         <createHouseRecordInput>
            <RequestHeader>
               <clientIdentifier>webserviceuser</clientIdentifier>
            </RequestHeader>
            <createHouseRecordIn>
               <SiteID>$SiteID$</SiteID>
               <Location>01</Location>
               <Street>sprint 38 LN</Street>
               <Apartment>$aptNum$</Apartment>
               <City>BONAIRE</City>
               <State>GA</State>
               <Zip>31005</Zip>
               <Company>01</Company>
               <Division>10</Division>
               <Franchise>577</Franchise>
               <Dwelling>B</Dwelling>
               <BillType>C</BillType>
               <UndeliverableAddress>N</UndeliverableAddress>
               <TarCode>011057700</TarCode>
               <PrimaryLocationCode>S150</PrimaryLocationCode>
               <SecondaryLocationCode>005</SecondaryLocationCode>
               <SignalAccess>U</SignalAccess>
               <Headend>23</Headend>
               <Node>$node$</Node>
               <Interactive> </Interactive>
               <Addressable>N</Addressable>
               <PreWired>Y</PreWired>
               <PrismCode>99</PrismCode>
               <RateCenter>MACON</RateCenter>
               <ServiceStatus>
                  <ServiceCategory>T</ServiceCategory>
                  <ServiceableStatus>TH</ServiceableStatus>
                  <AutoAssign>N</AutoAssign>
               </ServiceStatus>
               <ServiceStatus>
                  <ServiceCategory>H</ServiceCategory>
                  <ServiceableStatus>HY</ServiceableStatus>
                  <AutoAssign>N</AutoAssign>
               </ServiceStatus>
               <ServiceStatus>
                  <ServiceCategory>C</ServiceCategory>
                  <ServiceableStatus>CY</ServiceableStatus>
                  <AutoAssign>N</AutoAssign>
               </ServiceStatus>
               <ServiceStatus>
                  <ServiceCategory>D</ServiceCategory>
                  <ServiceableStatus>DY</ServiceableStatus>
                  <AutoAssign>N</AutoAssign>
               </ServiceStatus>
               <ServiceStatus>
                  <ServiceCategory>S</ServiceCategory>
                  <ServiceableStatus>SY</ServiceableStatus>
                  <AutoAssign>N</AutoAssign>
               </ServiceStatus>
            </createHouseRecordIn>
         </createHouseRecordInput>
      </hous:createHouseRecord>
   </soap:Body>
</soap:Envelope>